In [13]:
import pandas as pd
import numpy as np

In [23]:
df=pd.read_csv('titanic_train.csv')

In [3]:
df.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
dic={'C': 1, 'Q':2, 'S' : 3}

In [24]:
df.dtypes

survived      int64
pclass        int64
name         object
sex          object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
cabin        object
embarked     object
dtype: object

In [31]:
df.isna().sum()

survived      0
pclass        0
name          0
sex           0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      0
dtype: int64

In [32]:
df['age'].fillna(df['age'].median(), inplace=True)

In [35]:
df['age'].median()

28.0

In [36]:
df['age'].mean()

29.36158249158249

In [34]:
df.isna().sum()

survived      0
pclass        0
name          0
sex           0
age           0
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      0
dtype: int64

In [27]:
df['embarked']=df['embarked'].map(dic)

In [15]:
df.fillna?

In [14]:
df['embarked'].fillna?

Object `fillna` not found.

In [25]:
df['embarked'].fillna('S', inplace=True)

In [28]:
df['embarked'].astype(int)

0      3
1      1
2      3
3      3
4      3
5      2
6      3
7      3
8      3
9      1
10     3
11     3
12     3
13     3
14     3
15     3
16     2
17     3
18     3
19     1
20     3
21     3
22     2
23     3
24     3
25     3
26     1
27     3
28     2
29     3
      ..
861    3
862    3
863    3
864    3
865    3
866    1
867    3
868    3
869    3
870    3
871    3
872    3
873    3
874    1
875    1
876    3
877    3
878    3
879    1
880    3
881    3
882    3
883    3
884    3
885    2
886    3
887    3
888    3
889    1
890    2
Name: embarked, Length: 891, dtype: int64

In [29]:
df.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,3
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,3
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,3

In [39]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (0.23.4)
Requirement already satisfied: pytz>=2011k in /usr/lib/python3/dist-packages (from pandas) (2018.3)
Requirement already satisfied: python-dateutil>=2.5.0 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.7.3)
Requirement already satisfied: numpy>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.15.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)
You are using pip version 18.0, however version 18.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [40]:
from sklearn.metrics import accuracy_score